function [ Cbn ] = a2mat( att )
%% **************************************************************
%名称：Attitude to dirction cosine MATrix 
%功能：@ 捷联惯导算法与组合导航原理 P231
%完全复制版本
%________________________________________________________________________
% 输入：
%       att: 姿态角 ，rad 
%       att: 有三个分量，依次为俯仰theta、横滚gamma和航向psi。 航向角北偏
%       西为正,取值为（-pi, pi]
% 输出：
%       Cbn: 从b系到n系的坐标变换矩阵, 也是从n系到b系的坐标系转换矩阵
%_________________________________________________________________________
%作者：哈尔滨工程大学 自动化学院 张峥
%日期：2020年10月2日
% ************************************************************************
%%
s = sin(att);
c = cos(att);

si = s(1);
sj = s(2);
sk = s(3);

ci = c(1);
cj = c(2);
ck = c(3);

Cbn = [cj*ck - si*sj*sk, -ci*sk, sj*ck + si*cj*sk
       cj*sk + si*sj*ck,  ci*ck, sj*sk - si*cj*ck
                 -ci*sj,     si,            ci*cj];
end
