function [ qbn ] = a2qua( att )
%% **************************************************************
%名称：Attitude to QUAternion
%功能：将姿态角转化为姿态四元数
%________________________________________________________________________
% 输入：
%       att: 有三个分量，依次为俯仰theta、横滚gamma和航向psi。 航向角北偏
%       西为正,取值为（-pi, pi]
% 输出：
%       qbn: rn = qbn*rb*qbn'
%_________________________________________________________________________
%作者：哈尔滨工程大学 自动化学院 张峥
%日期：2020年10月2日
% ************************************************************************
%%
% 程序@ 捷联惯导算法与组合导航原理  P232
% 原理@ P247
s = sin(att/2);
c = cos(att/2);

si = s(1);  sj = s(2);  sk = s(3);
ci = c(1);  cj = c(2);  ck = c(3);

qbn = [ci*cj*ck - si*sj*sk
       si*cj*ck - ci*sj*sk
       ci*sj*ck + si*cj*sk
       ci*cj*sk + si*sj*ck];

end

