function [ wm, vm ] = imuadderr( wm, vm, eb, web, db, wdb, ts )
%% **************************************************************
%名称：imu add error
%功能：给真实imu输出添加误差，模拟实际中带有量测噪声的imu输出。
%程序@ 捷联惯导算法与组合导航原理 P235
%________________________________________________________________________
% 输入：
%       wm: n×3 矩阵，每一行对应一个角增量：[theta_x, theta_y, theta_z] rad
%       vm: n×3 矩阵，每一行对应一个速度增量 m/s
%       eb: 陀螺仪常值漂移，即陀螺零偏
%       web:角度随机游走误差
%       db: 加速度计常值偏置
%       wdb: 速度随机游走误差
%       ts: 步长 s
% 输出：
%       wm: 添加了误差的角增量
%       vm: 添加了误差的速度增量
%_________________________________________________________________________
%作者：哈尔滨工程大学 自动化学院 张峥
%日期：2020年10月7日
% ************************************************************************
%%
% 数据个数
m = size(wm, 1);

% 步长开平方
sts = sqrt(ts);

wm = wm + [ts*eb(1) + sts*web(1)*randn(m, 1), ...
           ts*eb(2) + sts*web(2)*randn(m, 1), ...
           ts*eb(3) + sts*web(3)*randn(m, 1)];

vm = vm + [ts*db(1) + sts*wdb(1)*randn(m, 1), ...
           ts*db(2) + sts*wdb(2)*randn(m, 1), ...
           ts*db(3) + sts*wdb(3)*randn(m, 1)];

end
