function  progressTip( crt, ts_update, interval )
%% **************************************************************
%名称：progress tip
%功能：显示当前程序运行进度
%________________________________________________________________________
%
%_________________________________________________________________________
%作者：哈尔滨工程大学 智能科学与工程学院 张峥
%日期：2020年11月5日
% ************************************************************************
%%
if exist('interval', 'var')
    % 已经设置了interval, do notiong  
else
    % 默认每100s输出一次程序运行进程信息
    interval = 100;
end

if mod(crt, interval) < ts_update
    disp(fix(crt));
end

end