function [ phi ] = qq2phi( qbp, qbn )
%% **************************************************************
%名称：Quaternion Quaternion to PHI
%功能：计算含有误差的姿态四元数和真值之间对应的等效旋转矢量
%________________________________________________________________________
% 输入：
%       qbp: 含有误差的姿态四元数
%       qbn: 真实姿态四元数
% 输出：
%       phi: n系到p系的等效旋转矢量
%_________________________________________________________________________
%作者：哈尔滨工程大学 自动化学院 张峥
%日期：2020年10月3日
% ************************************************************************
%%
qerr = qmul(qbn, qconj(qbp));
phi = q2rv(qerr);

end

