function [ qt ] = Runge_Kutta_att_update( q0, wn, ts )
%% **************************************************************
%名称：4 order Runge-Kutta algorithm for attitude update
%功能：已知t0时刻四元数q0，imu测得t=t0,t0.5,t1 三个时刻的角速度，计算t1时刻
% 四元数qt
%原理@ 捷联惯导算法与组合导航原理 P257
%________________________________________________________________________
% 输入：
%       q0: t=t0时刻的四元数
%       wn: 共三行，每一行保存一个角速度
%       ts: 两次更新之间的间隔，ts=2*ts_imu
% 输出：
%       qt: t=t1时刻的四元数
%_________________________________________________________________________
%作者：哈尔滨工程大学 智能科学与工程学院 张峥
%日期：2020年11月2日
% ************************************************************************
%%
% 三次采样的角速度
w1 = wn(1, :)';
w2 = wn(2, :)';
w3 = wn(3, :)';

K1 = w1;
K2 = w2 + ts/4*skew(K1)*w2 + ts*ts/48*skew(K1)*skew(K1)*w2;
K3 = w2 + ts/4*skew(K2)*w2 + ts*ts/48*skew(K2)*skew(K2)*w2;
K4 = w3 + ts/2*skew(K3)*w3 + ts*ts/12*skew(K3)*skew(K3)*w3;

Phi = ts/6*(K1 + 2*K2 + 2*K3 + K4);
q_Phi = [cos(norm(Phi)/2), Phi'/norm(Phi)*sin(norm(Phi)/2)]';
qt = qmul(q0, q_Phi);

end

