function [] = setGl_earth()
%% **************************************************************
%名称：Set Global Variable - Earth variable
%功能：设置全局变量 地球相关参数
%_________________________________________________________________________
%作者：哈尔滨工程大学 智能科学与工程学院 张峥
%日期：2020年12月2日
% ************************************************************************
%% 
global Gl
Gl.Call_earth = true;

Gl.GM = 3.986004415e14; % 地球引力常数
Gl.Re = 6.378136998405e6; % 地球赤道半径
Gl.Rp = 6.356752312655527e+06; % 两极半径
Gl.ff = 1/298.257223563; % 地球扁率 ff = (Re - Rp)/Re
Gl.e2 = 0.006694379990141; % 地球偏心率的平方
Gl.wie = 7.2921151467e-5; % 地球自转角速度
Gl.meru = 7.2921151467e-8; % 毫地转角速率
Gl.ge = 9.780325333434361; % 赤道重力加速度
Gl.gp = 9.832184935381024; % 极点重力加速度
Gl.g0 = 9.780325333434361; % 通常重力加速度，默认为ge
Gl.nm = 1853;  % 1海里 = 1853 (m)
end