function [ skew_matrix ] =skew( theta )
%名称：Skew matrix
%功能：3×1向量theta对应的反对称矩阵
%________________________________________________________________________
% 输入：
%       theta: (rad*vector) 3×1向量，通常是角增量或等效旋转矢量
% 输出：
%       skew_matrix: (1) 反对称矩阵
%_________________________________________________________________________
%作者：哈尔滨工程大学 自动化学院 张峥
%日期：2020年8月14日
% ************************************************************************
%%
skew_matrix=[       0, -theta(3),  theta(2)
             theta(3),         0, -theta(1)
            -theta(2),  theta(1),        0];
end

